Revit 2027 API
Floor.GetDefaultFloorType Method
 Returns id of default floor type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetDefaultFloorType(
	Document document,
	bool isFoundation
)
Public Shared Function GetDefaultFloorType (
	document As Document,
	isFoundation As Boolean
) As ElementId
public:
static ElementId^ GetDefaultFloorType(
	Document^ document,
	bool isFoundation
)
static member GetDefaultFloorType :
        document : Document *
        isFoundation : bool -> ElementId
Parameters
document Document
 The document.
isFoundation Boolean
 True to return id of foundation floor type.
Return Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Floor Class
Autodesk.Revit.DB Namespace